STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_bsp.c
/* External variables --------------------------------------------------------*/

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief   Initialisation of all used BSP and their Task if needed.
 */
void APP_BSP_Init( void )
{
#if (CFG_LED_SUPPORTED == 1)
  APP_BSP_LedInit();
#endif /* (CFG_LED_SUPPORTED == 1) */

#ifdef CFG_BSP_ON_DISCOVERY
#if (CFG_LCD_SUPPORTED == 1)
  APP_BSP_LcdInit();
#endif /* (CFG_LCD_SUPPORTED == 1) */

#if (CFG_JOYSTICK_SUPPORTED == 1)
  APP_BSP_JoystickInit();
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
#endif /* CFG_BSP_ON_DISCOVERY */

#if (CFG_BUTTON_SUPPORTED == 1)
  APP_BSP_ButtonInit();
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
}

/**
 * @brief   Verify if Wakeup is not done by a button (or Joystick)
 */
void APP_BSP_PostIdle( void )
{
#if (CFG_LPM_STDBY_SUPPORTED != 0)
#if (CFG_BUTTON_SUPPORTED == 1)
  /* Treatment of WakeUp Button */
  if ( ( PWR->WUSR & PWR_WAKEUP_PIN2 ) != 0 )
  {
    PWR->WUSCR = PWR_WAKEUP_PIN2;
    BSP_PB_Callback( B1 );
  }
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)
  /* Treatment of WakeUp Joystick */
#ifdef STM32WBA65xx
  if ( ( PWR->WUSR & PWR_WAKEUP_PIN5 ) != 0 )
  {
    PWR->WUSCR = PWR_WAKEUP_PIN5;
    APP_BSP_JoystickTimerCallback(NULL);
  }
#else // STM32WBA65xx
  if ( ( PWR->WUSR & PWR_WAKEUP_PIN3 ) != 0 )
  {
    PWR->WUSCR = PWR_WAKEUP_PIN3;
    APP_BSP_JoystickTimerCallback(NULL);
  }
#endif // STM32WBA65xx
#endif /* CFG_JOYSTICK_SUPPORTED */
#endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */
}

/**
 * @brief   Re-Initialisation of all used BSP after a StandBy.
 */
void APP_BSP_StandbyExit( void )
{
#if (CFG_LED_SUPPORTED == 1)
  /* Leds Initialization */
#if defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx)
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#else /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
  BSP_LED_Init(LED_BLUE);
#ifdef CFG_BSP_ON_NUCLEO
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#endif /* CFG_BSP_ON_NUCLEO */
#endif /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
#endif /* (CFG_LED_SUPPORTED == 1) */

#if (CFG_JOYSTICK_SUPPORTED == 1)
#ifdef CFG_BSP_ON_DISCOVERY
  /* Joystick HW Initialization is not done after Standby */

#endif /* CFG_BSP_ON_DISCOVERY */
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */

#if (CFG_BUTTON_SUPPORTED == 1)
#ifdef CFG_BSP_ON_CEB
  /* Button HW Initialization */
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
#endif /* CFG_BSP_ON_CEB */

#ifdef CFG_BSP_ON_NUCLEO
  /* Buttons HW Initialization */
  BSP_PB_Init( B1, BUTTON_MODE_EXTI );
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
  BSP_PB_Init( B3, BUTTON_MODE_EXTI );
#endif /* CFG_BSP_ON_NUCLEO */
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
}

#if ( CFG_BUTTON_SUPPORTED == 1 )

/**
 * @brief   Indicate if the selected button was pressed during a 'long time' or not.
 *
 * @param   btnIdx    Button to test, listed in enum Button_TypeDef
 * @return  '1' if pressed during a 'long time', else '0'.
 */
uint8_t APP_BSP_ButtonIsLongPressed( uint16_t btnIdx )
{
  uint8_t pressStatus = 0;

  if ( btnIdx < BUTTON_NB_MAX )
  {
    pressStatus = buttonDesc[btnIdx].longPressed;
    buttonDesc[btnIdx].longPressed = 0;
  }

  return pressStatus;
}

/**
 * @brief   'Manually' set the selected button as pressed during a 'long time'.
 *
 * @param   btnIdx    Button to test, listed in enum Button_TypeDef
 */
void APP_BSP_SetButtonIsLongPressed( uint16_t btnIdx )
{
  buttonDesc[btnIdx].longPressed = 1;
}

/**
 * @brief  Action of button 1 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button1Action( void )
{
}

/**
 * @brief  Action of button 2 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button2Action( void )
{
}

/**
 * @brief  Action of button 3 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button3Action( void )
{
}

#endif /* ( CFG_BUTTON_SUPPORTED == 1 )  */
#if ( CFG_JOYSTICK_SUPPORTED == 1 )

/**
 * @brief   In UseCase '1' & '3', indicate if the current Joystick was pressed during a 'long time' or not.
 *
 * @return  '1' if pressed during a 'long time', else '0'.
 */
uint8_t APP_BSP_JoystickIsLongPressed( void )
{
  return cJoystickLongPressed;
}


/**
 * @brief   In UseCase '1' & '3', indicate if the current Joystick was pressed during a 'Short time' or not.
 *
 * @return  '1' if pressed during a 'Short time', else '0'.
 */
uint8_t APP_BSP_JoystickIsShortReleased( void )
{
  if ( cJoystickLongPressed == 0u )
  {
    return 1;
  }
  else
  {
    return 0;
  }
}


/**
 * @brief   In UseCase '1' & '3', indicate if the current Joystick was just pressed or not.
 *
 * @return  '1' if just pressed, else '0'.
 */
uint8_t APP_BSP_JoystickIsInitialPress( void )
{
  return cJoystickInitialPress;
}

/**
 * @brief  Action of Joystick UP when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickUpAction( void )
{
}

/**
 * @brief  Action of Joystick RIGHT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickRightAction( void )
{
}

/**
 * @brief  Action of Joystick DOWN when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickDownAction( void )
{
}

/**
 * @brief  Action of Joystick LEFT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickLeftAction( void )
{
}

/**
 * @brief  Action of Joystick SELECT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickSelectAction( void )
{
}

/**
 * @brief  Action of Joystick when Joystick return to NONE after an Action, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickNoneAction( void )
{
}

#endif /* ( CFG_JOYSTICK_SUPPORTED == 1 ) */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

#if ( CFG_LED_SUPPORTED == 1 )

/**
 * @brief  Initialisation of all LED on used boards.
 */
void APP_BSP_LedInit( void )
{
  /* Leds Initialization */
#if defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx)
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#else /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
  BSP_LED_Init(LED_BLUE);
#ifdef CFG_BSP_ON_NUCLEO
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#endif /* CFG_BSP_ON_NUCLEO */
#endif /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
}

#endif /* (CFG_LED_SUPPORTED == 1) */
#ifdef CFG_BSP_ON_DISCOVERY
#if (CFG_LCD_SUPPORTED == 1)

/**
 * @brief  Initialisation of the LCD screen on used Discovery board.
 */
void APP_BSP_LcdInit( void )
{
  int32_t   iStatus;

