STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_bsp.c
  /* LCD Initialisation */
  iStatus = BSP_LCD_Init( LCD1, LCD_ORIENTATION_LANDSCAPE );
  if ( iStatus == BSP_ERROR_NONE )
  {
    iStatus = BSP_LCD_DisplayOn( LCD1 );
  }

  if ( iStatus == BSP_ERROR_NONE )
  {
    /* LCD Management Initialisation */
    UTIL_LCD_SetFuncDriver( &LCD_Driver );

    /* Clear the Background Layer */
    UTIL_LCD_Clear( LCD_COLOR_BLACK );

    /* Select font and Color */
    UTIL_LCD_SetFont( &Font12 );
    UTIL_LCD_SetBackColor( LCD_COLOR_BLACK );
    UTIL_LCD_SetTextColor( LCD_COLOR_WHITE );
  }
}

#endif /* (CFG_LCD_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)

/**
 * @brief  Launch the Task selected by the joystick.
 *
 * @param  joystickState  position of joystick.
 * @retval None
 */
static void Joystick_LaunchActionTask( JOYPin_TypeDef joystickState )
{
  switch ( joystickState )
  {
#ifdef CFG_BSP_ON_FREERTOS
    case JOY_UP:
        osSemaphoreRelease( JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        osSemaphoreRelease( JoystickRightSemaphore );
        break;

    case JOY_DOWN:
        osSemaphoreRelease( JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        osSemaphoreRelease( JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        osSemaphoreRelease( JoystickSelectSemaphore );
        break;

    case JOY_NONE:
        osSemaphoreRelease( JoystickNoneSemaphore );
        break;
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
    case JOY_UP:
        tx_semaphore_put( &JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        tx_semaphore_put( &JoystickRightSemaphore );
        break;

    case JOY_DOWN:
        tx_semaphore_put( &JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        tx_semaphore_put( &JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        tx_semaphore_put( &JoystickSelectSemaphore );
        break;

    case JOY_NONE:
        tx_semaphore_put( JoystickNoneSemaphore );
        break;
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
    case JOY_UP:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_UP, CFG_SEQ_PRIO_0 );
        break;

    case JOY_RIGHT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_RIGHT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_DOWN:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_DOWN, CFG_SEQ_PRIO_0 );
        break;

    case JOY_LEFT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_LEFT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_SEL:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_SELECT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_NONE:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_NONE, CFG_SEQ_PRIO_0 );
        break;
#endif /* CFG_BSP_ON_SEQUENCER */

    default :   /* No Action */
                break;
  }
}

/**
  * @brief  Get Joystick state.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @retval BSP error code if value negative or one of following value:
  *     @arg JOY_NONE
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  */
static JOYPin_TypeDef APP_BSP_JoystickGetState( JOY_TypeDef eJoy )
{
  JOYPin_TypeDef  eJoyPin;
  uint16_t        iKeyConvertedValue;

  /* Get the converted value of regular channel */
  iKeyConvertedValue = HAL_ADC_GetValue( &hjoy_adc[eJoy] );

  /* The ADC value gives the pad pressed. Function of DK*/
  if ( ( iKeyConvertedValue >= 2800U ) && ( iKeyConvertedValue < 3600U ) )
  {
    eJoyPin = eJoystickStateList[0];
  }
  else if ( ( iKeyConvertedValue >= 2000U ) && ( iKeyConvertedValue < 2800U ) )
  {
    eJoyPin = eJoystickStateList[1];
  }
  else if ( ( iKeyConvertedValue >= 1200U ) && ( iKeyConvertedValue < 2000U ) )
  {
    eJoyPin = eJoystickStateList[2];
  }
  else if ( ( iKeyConvertedValue >= 400U ) && ( iKeyConvertedValue < 1200U ) )
  {
    eJoyPin = eJoystickStateList[3];
  }
  else if ( iKeyConvertedValue < 400U )
  {
    eJoyPin = eJoystickStateList[4];
  }
  else
  {
    eJoyPin = JOY_NONE;
  }

  return eJoyPin;
}


/**
 *
 */
static void APP_BSP_JoystickSampleManage( void )
{
  JOYPin_TypeDef          eJoystickState;
#if (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_BUTTON_WITH_TIME) || (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER)
  static bool             bActionDone = false;
  static uint32_t         lStartTime = 0;
#endif /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_BUTTON_WITH_TIME) || (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER) */

  /* Init, Start, Sample & DeInit Joystick */
  BSP_JOY_Init( JOY1, JOY_MODE_POLLING, JOY_ALL );

  HAL_ADC_Start( &hjoy_adc[JOY1] );

  /* Wait first conversion */
  if ( HAL_ADC_PollForConversion( &hjoy_adc[JOY1], ( JOYSTICK_PRESS_SAMPLE_MS / 2u ) ) == HAL_OK )
  {
    eJoystickState = APP_BSP_JoystickGetState( JOY1 );

    BSP_JOY_DeInit(JOY1, JOY_ALL);

#if (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_BUTTON_WITH_TIME) || (CFG_JOYSTICK_USE_TYPE == 3)
    /* Process Joystick information. */
    if ( ( eJoystickState != JOY_NONE ) && ( eJoystickState == eJoystickPreviousState ) )
    {
      /* Verify if it's a LongTime */
      if ( bActionDone == false )
      {
        lStartTime += JOYSTICK_PRESS_SAMPLE_MS;
        if ( lStartTime > JOYSTICK_LONG_PRESS_THRESHOLD_MS )
        {
          cJoystickLongPressed = 1;
          bActionDone = true;
          cJoystickInitialPress = 0;
          Joystick_LaunchActionTask( eJoystickState );
        }
#if (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER)
        else
        {
          if ( cJoystickInitialPress == 0 )
          {
            cJoystickInitialPress = 1;
            Joystick_LaunchActionTask( eJoystickState );
          }
        }
#endif /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER) */
      }
    }
    else
    {
      if ( ( eJoystickState == JOY_NONE ) && ( eJoystickState != eJoystickPreviousState ) )
      {
        /* Verify if it's a 'Short Pressed' case */
        if ( ( lStartTime != 0u ) && ( bActionDone == false ) )
        {
          cJoystickInitialPress = 0;
          Joystick_LaunchActionTask( eJoystickPreviousState );
        }
      }
      else
      {
        cJoystickLongPressed = 0;
        cJoystickInitialPress = 0;
        bActionDone = false;
        lStartTime = 0;
      }
    }
#else /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_BUTTON_WITH_TIME) || (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER) */
    /* Process Joystick information. */
#if (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_CHANGE)
    if ( eJoystickState != eJoystickPreviousState )
#else /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_CHANGE) */
#if (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_JOYSTICK)
    if ( eJoystickState != JOY_NONE )
#else /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_JOYSTICK) */
    if ( ( eJoystickState != JOY_NONE ) && ( eJoystickState != eJoystickPreviousState ) )
#endif /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_JOYSTICK) */
#endif /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_CHANGE) */
    {
      Joystick_LaunchActionTask( eJoystickState );
    }
#endif /* (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_BUTTON_WITH_TIME) || (CFG_JOYSTICK_USE_TYPE == JOYSTICK_USE_AS_MATTER) */
  
