STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_bsp.c
    /* Set State */
    eJoystickPreviousState = eJoystickState;
  }
  else
  {
    BSP_JOY_DeInit(JOY1, JOY_ALL);
  }

  /* Restart Timer if needed */
#if (CFG_LPM_STDBY_SUPPORTED != 0)
  if ( eJoystickState != JOY_NONE )
  {
    UTIL_TIMER_Start( &stJoystickTimer );
  }
#else /* (CFG_LPM_STDBY_SUPPORTED != 0) */
  UTIL_TIMER_Start( &stJoystickTimer );
#endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */
}


/**
 *
 */
static void APP_BSP_JoystickTimerCallback(void *arg)
{
#ifdef CFG_BSP_ON_SEQUENCER
  UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_SAMPLE, CFG_SEQ_PRIO_0);
#endif /* CFG_BSP_ON_SEQUENCER */
#ifdef CFG_BSP_ON_FREERTOS
  osSemaphoreRelease( JoystickSampleSemaphore );
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
  tx_semaphore_put( &JoystickSampleSemaphore );
#endif /* CFG_BSP_ON_THREADX */
}

#ifdef CFG_BSP_ON_FREERTOS

/**
 * @brief  Management of the Joystick Sample task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickSampleTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickSampleSemaphore, osWaitForever );
    APP_BSP_JoystickSampleManage();
  }
}

/**
 * @brief  Management of the Joystick Up task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickUpTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickUpSemaphore, osWaitForever );
    APP_BSP_JoystickUpAction();
  }
}

/**
 * @brief  Management of the Joystick Right task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickRightTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickRightSemaphore, osWaitForever );
    APP_BSP_JoystickRightAction();
  }
}

/**
 * @brief  Management of the Joystick Down task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickDownTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickDownSemaphore, osWaitForever );
    APP_BSP_JoystickDownAction();
  }
}

/**
 * @brief  Management of the Joystick Left task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickLeftTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickLeftSemaphore, osWaitForever );
    APP_BSP_JoystickLeftAction();
  }
}

/**
 * @brief  Management of the Joystick Select task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickSelectTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickSelectSemaphore, osWaitForever );
    APP_BSP_JoystickSelectAction();
  }
}

/**
 * @brief  Management of the Joystick None task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickNoneTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickNoneSemaphore, osWaitForever );
    APP_BSP_JoystickNoneAction();
  }
}

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void )
{
  /* Register Semaphore & Task for the Joystick Sample Management Semaphore */
  JoystickSampleSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickSampleThread = osThreadNew( JoystickSampleTask, NULL, &JoystickSampleThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickUpSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickUpThread = osThreadNew( JoystickUpTask, NULL, &JoystickUpThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickRightSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickRightThread = osThreadNew( JoystickRightTask, NULL, &JoystickRightThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickDownSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickDownThread = osThreadNew( JoystickDownTask, NULL, &JoystickDownThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickLeftSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickLeftThread = osThreadNew( JoystickLeftTask, NULL, &JoystickLeftThreadAttributes );

  /* Register Semaphore & Task for the Joystick Select Semaphore */
  JoystickSelectSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickSelectThread = osThreadNew( JoystickSelectTask, NULL, &JoystickSelectThreadAttributes );

  /* Register Semaphore & Task for the Joystick None Semaphore */
  JoystickNoneSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickNoneThread = osThreadNew( JoystickNoneTask, NULL, &JoystickNoneThreadAttributes );

  if ( ( JoystickSampleSemaphore == NULL ) || ( JoystickUpSemaphore == NULL ) || ( JoystickRightSemaphore == NULL ) || ( JoystickDownSemaphore == NULL )
      || ( JoystickLeftSemaphore == NULL ) || ( JoystickSelectSemaphore == NULL ) || ( JoystickNoneSemaphore == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Semaphore for Joystick" );
    while(1);
  }

  if ( ( JoystickSampleThread == NULL ) || ( JoystickUpThread == NULL ) || ( JoystickRightThread == NULL ) || ( JoystickDownThread == NULL )
      || ( JoystickLeftThread == NULL ) || ( JoystickSelectThread == NULL ) || ( JoystickNoneThread == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Task for Joystick" );
    while(1);
  }
}

#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX

/**
 * @brief  Management of the Joystick Sample task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickSampleTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickSampleSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickSampleManage();
  }
}

/**
 * @brief  Management of the Joystick Up task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickUpTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickUpSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickUpAction();
  }
}

/**
 * @brief  Management of the Joystick Right task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickRightTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickRightSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickRigthAction();
  }
}

/**
 * @brief  Management of the Joystick Down task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickDownTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickDownSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickDownAction();
  }
}

/**
 * @brief  Management of the Joystick Left task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickLeftTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickLeftSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickLeftAction();
  }
}

/**
 * @brief  Management of the Joystick Select task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickSelectTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickSelectSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickSelectAction();
  }
}

/**
 * @brief  Management of the Joystick None task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickNoneTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickNoneSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickNoneAction();
  }
}

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void )
{
  UINT    ThreadXStatus;
  CHAR    *pStack;

